//检查变量定义运算和流程错误。
// int a = 0;
// int b;
// int a = 2;
// //检查同类型不同值的初始化错误。√
// float a;
// //检查不同类型声明错误。√，存在问题是检查了两遍，重复输出。
// int main()
// {
//     a = c;
//     //检查右值变量未声明错误。√
//     c = 5;
//     //检查左值未声明错误。√
//     a = b;
//     //检查右值未初始化错误。√
//     float a = 4;
//     //检查局部变量是否可以正确覆盖全局变量。√
//     break;
//     //检查流程错误。√
//     continue;
//     //检查流程错误。√
// }
// int a;
// int a = 4;
// //此处应该不冲突。√，有点问题是会重复加入符号表，使用find访问无影响。
// int a(int b)
// {
//     return 0;
// } //检查存在同名变量错误。√，存在一个参数被装进去的问题，改TX【top】。

//检查函数定义。
// int foo(int b) { return 0; }
// // √
// float foo() { return 0; }
// //检查存在不同类型的同名函数错。√
// int foo(int a) { return 1; }
// //检查存在相同类型的同名函数错。√
// int main()
// {
//     foo = 4;
//     //检查函数当成左值变量错误。√
//     int a = foo * 4;
//     //检查函数当成右值变量错误。√，存在输出格式小问题。
// }

//检查函数调用。
int func(int a, float b) { return 0; }
int val;
int main()
{
    func1();
    //检查未声明函数被错误调用。√
    val(2, 3);
    //检查调用变量做函数错误。√
    func(2, 3, 5);
    func(2);
    func(2, 3);
    //检查参数调用个数错误;√
    return 0;
}

//检查函数返回。
// void func2(int a) { return 1; }
// int func3() { return; }
// //检查函数的返回错误。

//检查数组错误。
// int a[10];
// int val = 3;
// int main()
// {
//     val = 3;
//     a[0] = 34;
//     int b;
//     b = a[2.43]; // √
//     int d, e;
//     d = a; // √
//     a = 4; //√
//     e = val[3]; //√
//     c[23];      //√
//     return a;   // √
//}
